Ordinal numbering encoding or Label **Encoding¶**

Ordinal data is a categorical, statistical data type where the variables have natural, ordered categories and the distances between the categories is not known.
For example:

Student's grade in an exam (A, B, C or Fail).
Educational level, with the categories: Elementary school, High school, College graduate, PhD ranked from 1 to 4.
When the categorical variables are ordinal, the most straightforward best approach is to replace the labels by some ordinal number based on the ranks

In [1]:
import pandas as pd
import datetime

In [2]:
# create a variable with dates, and from that extract the weekday
# I create a list of dates with 20 days difference from today
# and then transform it into a datafame

df_base = datetime.datetime.today()
df_date_list = [df_base - datetime.timedelta(days=x) for x in range(0, 20)]
df = pd.DataFrame(df_date_list)
df.columns = ['day']
df

                          day
0  2021-10-27 13:14:11.110618
1  2021-10-26 13:14:11.110618
2  2021-10-25 13:14:11.110618
3  2021-10-24 13:14:11.110618
4  2021-10-23 13:14:11.110618
5  2021-10-22 13:14:11.110618
6  2021-10-21 13:14:11.110618
7  2021-10-20 13:14:11.110618
8  2021-10-19 13:14:11.110618
9  2021-10-18 13:14:11.110618
10 2021-10-17 13:14:11.110618
11 2021-10-16 13:14:11.110618
12 2021-10-15 13:14:11.110618
13 2021-10-14 13:14:11.110618
14 2021-10-13 13:14:11.110618
15 2021-10-12 13:14:11.110618
16 2021-10-11 13:14:11.110618
17 2021-10-10 13:14:11.110618
18 2021-10-09 13:14:11.110618
19 2021-10-08 13:14:11.110618

In [17]:
# extract the week day name

df['day_of_week'] = df['day'].dt.day_name()
df.head()

                         day day_of_week
0 2021-10-27 13:14:11.110618   Wednesday
1 2021-10-26 13:14:11.110618     Tuesday
2 2021-10-25 13:14:11.110618      Monday
3 2021-10-24 13:14:11.110618      Sunday
4 2021-10-23 13:14:11.110618    Saturday

In [18]:
# Engineer categorical variable by ordinal number replacement

weekday_map = {'Monday':1,
               'Tuesday':2,
               'Wednesday':3,
               'Thursday':4,
               'Friday':5,
               'Saturday':6,
               'Sunday':7
}

df['day_ordinal'] = df.day_of_week.map(weekday_map)
df.head(20)

                          day day_of_week  day_ordinal
0  2021-10-27 13:14:11.110618   Wednesday            3
1  2021-10-26 13:14:11.110618     Tuesday            2
2  2021-10-25 13:14:11.110618      Monday            1
3  2021-10-24 13:14:11.110618      Sunday            7
4  2021-10-23 13:14:11.110618    Saturday            6
5  2021-10-22 13:14:11.110618      Friday            5
6  2021-10-21 13:14:11.110618    Thursday            4
7  2021-10-20 13:14:11.110618   Wednesday            3
8  2021-10-19 13:14:11.110618     Tuesday            2
9  2021-10-18 13:14:11.110618      Monday            1
10 2021-10-17 13:14:11.110618      Sunday            7
11 2021-10-16 13:14:11.110618    Saturday            6
12 2021-10-15 13:14:11.110618      Friday            5
13 2021-10-14 13:14:11.110618    Thursday            4
14 2021-10-13 13:14:11.110618   Wednesday            3
15 2021-10-12 13:14:11.110618     Tuesday            2
16 2021-10-11 13:14:11.110618      Monday            1
17 2021-10-10 13:14:11.110618      Sunday            7
18 2021-10-09 13:14:11.110618    Saturday            6
19 2021-10-08 13:14:11.110618      Friday            5

Ordinal Measurement Advantages
Ordinal measurement is normally used for surveys and questionnaires. Statistical analysis is applied to the responses once they are collected to place the people who took the survey into the various categories. The data is then compared to draw inferences and conclusions about the whole surveyed population with regard to the specific variables. The advantage of using ordinal measurement is ease of collation and categorization. If you ask a survey question without providing the variables, the answers are likely to be so diverse they cannot be converted to statistics.

With Respect to Machine Learning

Keeps the semantical information of the variable (human readable content)
Straightforward
Ordinal Measurement Disadvantages
The same characteristics of ordinal measurement that create its advantages also create certain disadvantages. The responses are often so narrow in relation to the question that they create or magnify bias that is not factored into the survey. For example, on the question about satisfaction with the governor, people might be satisfied with his job performance but upset about a recent sex scandal. The survey question might lead respondents to state their dissatisfaction about the scandal, in spite of satisfaction with his job performance -- but the statistical conclusion will not differentiate.

With Respect to Machine Learning

Does not add machine learning valuable information

**Count or frequency encoding High Cardinality**

****

Count or frequency encoding
High Cardinality


Another way to refer to variables that have a multitude of categories, is to call them variables with high cardinality.

If we have categorical variables containing many multiple labels or high cardinality,then by using one hot encoding, we will expand the feature space dramatically.

One approach that is heavily used in Kaggle competitions, is to replace each label of the categorical variable by the count, this is the amount of times each label appears in the dataset. Or the frequency, this is the percentage of observations within that category. The 2 are equivalent.

In [19]:
import pandas as pd
import numpy as np

# let's open the mercedes benz dataset for demonstration
# Download the dataset from the below link
#https://www.kaggle.com/aditya1702/mercedes-benz-data-exploration/data

df = pd.read_csv('mercedesbenz.csv', usecols=['X1', 'X2'])

In [20]:
df.head()

  X1  X2
0  v  at
1  t  av
2  w   n
3  t   n
4  v   n

In [22]:
df.shape

(1368, 2)

**ONE HOT INCODING**

In [23]:
pd.get_dummies(df).shape

(1368, 62)

In [24]:
len(df['X1'].unique())

27

In [25]:
len(df['X2'].unique())

37

In [26]:
# let's have a look at how many labels

for col in df.columns[0:]:
    print(col, ': ', len(df[col].unique()), ' labels')

X1 :  27  labels
X2 :  37  labels

In [27]:
# let's obtain the counts for each one of the labels in variable X2
# let's capture this in a dictionary that we can use to re-map the labels

df.X2.value_counts().to_dict()

{'a': 14,
 'ac': 6,
 'ae': 108,
 'ag': 6,
 'ah': 3,
 'ai': 144,
 'ak': 76,
 'al': 2,
 'am': 1,
 'an': 1,
 'ao': 18,
 'ap': 9,
 'aq': 21,
 'as': 574,
 'at': 2,
 'au': 2,
 'av': 2,
 'aw': 1,
 'ay': 18,
 'b': 14,
 'd': 6,
 'e': 21,
 'f': 25,
 'g': 3,
 'h': 2,
 'i': 7,
 'k': 7,
 'm': 165,
 'n': 31,
 'p': 1,
 'r': 31,
 's': 25,
 't': 4,
 'x': 2,
 'y': 10,
 'z': 5}

In [28]:
# And now let's replace each label in X2 by its count

# first we make a dictionary that maps each label to the counts
df_frequency_map = df.X2.value_counts().to_dict()

In [29]:
df.head(100)

    X1  X2
0    v  at
1    t  av
2    w   n
3    t   n
4    v   n
..  ..  ..
95   b   m
96   l  as
97  aa  as
98   b   m
99   s   m

[100 rows x 2 columns]

In [30]:
# and now we replace X2 labels in the dataset df
df.X2 = df.X2.map(df_frequency_map)

df.head()

  X1    X2
0  v   2.0
1  t   2.0
2  w  31.0
3  t  31.0
4  v  31.0

There are some advantages and disadvantages that we will discuss now

Advantages
It is very simple to implement
Does not increase the feature dimensional space
Disadvantages
If some of the labels have the same count, then they will be replaced with the same count and they will loose some valuable information.
2 Adds somewhat arbitrary numbers, and therefore weights to the different labels, that may not be related to their predictive power

Follow this thread in Kaggle for more information: https://www.kaggle.com/general/16927

USING LABEL ENCODE FROM SKLEARN

In [49]:
from sklearn.preprocessing import LabelEncoder
import pandas as pd
import numpy as np

In [50]:
df=pd.read_csv("/content/Iris.csv")

In [51]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [52]:
df['Species'].value_counts()

Iris-virginica     50
Iris-versicolor    50
Iris-setosa        50
Name: Species, dtype: int64

In [53]:
# loding the label encoder
label_encoder_1 = LabelEncoder()

In [54]:
df_labels = label_encoder_1.fit_transform(df.Species)

In [55]:
df['target'] = df_labels

In [56]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  ...  PetalWidthCm      Species target
0   1            5.1           3.5  ...           0.2  Iris-setosa      0
1   2            4.9           3.0  ...           0.2  Iris-setosa      0
2   3            4.7           3.2  ...           0.2  Iris-setosa      0
3   4            4.6           3.1  ...           0.2  Iris-setosa      0
4   5            5.0           3.6  ...           0.2  Iris-setosa      0

[5 rows x 7 columns]

In [57]:
df['target'].value_counts()

2    50
1    50
0    50
Name: target, dtype: int64

In [61]:
df['Species']=label_encoder_1.fit_transform(df['Species'])

In [62]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  ...  PetalWidthCm  Species  target
0   1            5.1           3.5  ...           0.2        0       0
1   2            4.9           3.0  ...           0.2        0       0
2   3            4.7           3.2  ...           0.2        0       0
3   4            4.6           3.1  ...           0.2        0       0
4   5            5.0           3.6  ...           0.2        0       0

[5 rows x 7 columns]

In [63]:
df['Species'].value_counts()

2    50
1    50
0    50
Name: Species, dtype: int64